src/DataProcessors/СохранениеЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СохранениеЗначений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаНастройки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИспользоватьПриОткрытии</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяНастройка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ссылка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НастройкиПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеГруппыНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНастроек</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыНастроек</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ТипНастройкиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипНастройкиПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкаОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/СохранениеЗначений/Forms/Сохранить/module.bsl
Перем ГруппаНастройкиДоИзм;
Перем ТекСсылка;
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//Процедура управляющая формой.
//
Процедура УправлениеФормой()
	
	Если СписокНастроек.Количество() = 0 Тогда
		
		ЭлементыФормы.ДействияСписокНастроек.Кнопки.Удалить.Доступность = Ложь;
		ЭлементыФормы.ДействияСписокНастроек.Кнопки.Изменить.Доступность = Ложь;
		ЭлементыФормы.ДействияСписокНастроек.Кнопки.Копировать.Доступность = Ложь;
		
	Иначе
		ЭлементыФормы.ДействияСписокНастроек.Кнопки.Изменить.Доступность = Истина;
		ЭлементыФормы.ДействияСписокНастроек.Кнопки.Копировать.Доступность = Истина;
		
	КонецЕсли;
	
	Если ТипНастройки = Перечисления.ТипНастройкиПользователя.ТабличнаяЧасть Тогда 
		ЭлементыФормы.СписокНастроек.Колонки.ИспользоватьПриОткрытии.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Обработчик события "ПередОткрытием" .
//
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если СохраняемоеЗначение = Неопределено 
	   И ИмяОбъекта = Неопределено
	   И ВидФормыСохранить = Неопределено
	   И ТипНастройки = Неопределено
	   И ТабличнаяЧасть = Неопределено Тогда
		Предупреждение("Данная обработка вызывается из других объектов конфигурации!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//Процедура-обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии()
	
	ЗаполнитьСписокНастроек(Неопределено);
	УправлениеФормой(); 
	//ЭлементыФормы.ГруппаНастройки.КнопкаВыбора 				= Истина;
	//ЭлементыФормы.ГруппаНастройки.КнопкаОчистки             = Истина;
				
	Если  ВидФормыСохранить Тогда
		ЭлементыФормы.СписокНастроек.Верх = 72;
		ЭлементыФормы.СписокНастроек.Высота = 165;
		ЭтаФорма.Заголовок = "Сохранение настроек";
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОК.Текст = "ОК";
		ЭлементыФормы.ПанельНаименованиеНастройки.Свертка = РежимСверткиЭлементаУправления.Нет;
		
	Иначе 
		ЭтаФорма.Заголовок = "Выбор настройки";
		ЭлементыФормы.ОсновныеДействияФормы.Кнопки.ОК.Текст = "Восстановить";
		//ЭлементыФормы.ПанельНаименованиеНастройки.Свертка = РежимСверткиЭлементаУправления.Верх;
		//ЭлементыФормы.ДействияСписокНастроек.Кнопки.Копировать.Доступность = Ложь;
		ЭлементыФормы.ПанельНаименованиеНастройки.Свертка = РежимСверткиЭлементаУправления.Верх;
		ЭлементыФормы.СписокНастроек.Верх = 8;
		ЭлементыФормы.СписокНастроек.Высота = 235;
	КонецЕсли;
	
	Если ВидФормыСохранить Тогда
		
		ЭлементыФормы.НаименованиеНастройки.АктивизироватьПоУмолчанию = Истина;
		
	Иначе
		
		ЭлементыФормы.СписокНастроек.АктивизироватьПоУмолчанию = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеНастройки" ТОгда
		
		Если  ЗначениеЗаполнено(ГруппаНастройки) Тогда
			ЗаполнитьСписокНастроек(ГруппаНастройки);
		Иначе
			ЗаполнитьСписокНастроек(Неопределено);
		КонецЕсли;
		
	КонецЕсли;	
	Если СписокНастроек.Найти(ТекСсылка) <> неопределено Тогда
		ЭлементыФормы.СписокНастроек.ТекущаяСтрока = Списокнастроек.Найти(ТекСсылка);
	КонецЕсли; 
КонецПроцедуры

 
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ, ВЫЗЫВАЕМЫЕ ИЗ ЭЛЕМЕНТОВ ФОРМЫ

//Процедура-обработчик события "ПриАктивизацииСтроки" ТЧ СписокНастроек.
//
Процедура СписокНастроекПриАктивизацииСтроки(Элемент)
	
	УправлениеФормой();
	Если ЭлементыФормы.СписокНастроек.ТекущаяСтрока <> Неопределено Тогда
		ЭлементыФормы.ДействияСписокНастроек.Кнопки.Удалить.Доступность = Истина;
		ТекСсылка =  ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка;
	КонецЕсли;

КонецПроцедуры 

//Процедура-обработчик события "ПриИзмененииФлажка" ТЧ СписокНастроек.
//
Процедура СписокНастроекПриИзмененииФлажка(Элемент, Колонка)
	
	ТекЗнач = ЭлементыФормы.СписокНастроек.ТекущаяСтрока.ИспользоватьПриОткрытии;
	ТекСтрока = ЭлементыФормы.СписокНастроек.ТекущаяСтрока;
	Если ТекЗнач тогда
		ДЛя Каждого Строка из СписокНастроек Цикл
			Строка.ИспользоватьПриОткрытии = Ложь;
		КонецЦикла;
	КонецЕсли;
	ТекСтрока.ИспользоватьПриОткрытии = ТекЗнач;
	ИзменитьПризнакВосстанавливатьПриОткрытии(ТекСтрока);
	
КонецПроцедуры


//Процедура-обработчик события "ПередУдалением" ТЧ СписокНастроек.
//
Процедура СписокНастроекПередУдалением(Элемент, Отказ)
		
		СсылкаНаУдаляемыйЭлемент = ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка;
		МассивСсылок = Новый Массив;
		МассивСсылок.Добавить(СсылкаНаУдаляемыйЭлемент);
		НайденныеСсылки = НайтиПоссылкам(МассивСсылок);
		
		Если НайденныеСсылки.Количество() > 0 Тогда 
			Предупреждение("Нельзя удалять данную настройку. Она используется прио открытии у пользователей!!!");
			Отказ = Истина;
			
		Иначе
			
			УдаляемыйЭлемент = СсылкаНаУдаляемыйЭлемент.ПолучитьОбъект();
			Удаляемыйэлемент.Удалить();			
			УправлениеФормой();
			
		КонецЕсли;
	
КонецПроцедуры
	
	
//Процедура-обработчик события "Выбор" ТЧ СписокНастроек.
//
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	Если ВидФормыСохранить Тогда
		
		Ответ = Вопрос("Перезаписать настройку """+  ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка+"""?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если ответ = КодВозвратаДиалога.Да Тогда
			ТекОбъект = ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка.ПолучитьОбъект();
			ТекОбъект.Значение = Новый ХранилищеЗначения(СохраняемоеЗначение);
			ТекОбъект.Записать();
			
			Сообщить("Настройка """ + ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка +""" была перезаписана!", СтатусСообщения.Внимание);
		КонецЕсли;
		
		
	Иначе
		
		ВосстановитьНастройку(ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка.Значение, ВладелецФормы);
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры


//Процедура-обработчик события "ПередНачаломДобавления" ТЧ СписокНастроек.
//
Процедура СписокНастроекПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Если Копирование ТОгда
		ТекОбъект = ЭлементыФормы.СписокНастроек.ТекущиеДанные.Ссылка.ПолучитьОбъект();
		НоваяНастройка = ТекОбъект.Скопировать();
		НоваяНастройка.Записать();
		Если ЗначениеЗаполнено(ГруппаНастройки) Тогда 
			Предупреждение("Создана персональная настройка"+" "+НаименованиеНастройки+"!");
		Иначе
			ЗаполнитьСписокНастроек(Неопределено);
		КонецЕсли;
		ФормаНастройки = НоваяНастройка.ПолучитьФорму();
		ФормаНастройки.ОткрытьМодально();
		Отказ = Истина;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры   


//Процедура-обработчик события "ПриВыводеСтроки" ТЧ СписокНастроек.
//
Процедура СписокНастроекПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	СинийЦвет = Новый Цвет(51,102,255);
	Если ДанныеСтроки.ОбщаяНастройка Тогда
		ОформлениеСтроки.ЦветТекста = СинийЦвет;
	КонецЕсли;
	
КонецПроцедуры


//Процедура-обработчик выбора из справочника"ГруппыНастроек".
//
Процедура ГруппаНастройкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗаполнитьСписокнастроек(ВыбранноеЗначение);
	ЭлементыФормы.НаименованиеНастройки.Доступность = Ложь;
	
КонецПроцедуры


//Процедура-обработчик события "НачалоВыбораИзСписка" элемента формы "ГруппаНастройки".
//
Процедура ГруппаНастройкиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)

	СписокГруппНастроек = Новый СписокЗначений;
	ТаблицаНастроек = ПараметрыСеанса.ТекущийПользователь.ГруппыНастроек.Выгрузить(, "ГруппаНастроек");
	МассивГрупп = ТаблицаНастроек.ВыгрузитьКолонку("ГруппаНастроек");
	СписокГруппНастроек.ЗагрузитьЗначения(МассивГрупп);
	ЭлементыФормы.ГруппаНастройки.СписокВыбора = СписокГруппНастроек;
	
КонецПроцедуры

//Процедура-обработчик события "Очистка" элемента формы "ГруппаНастройки".
//
Процедура ГруппаНастройкиОчистка(Элемент, СтандартнаяОбработка)
	
	ЗаполнитьСписокНастроек(Неопределено);
	ГруппаНастройкиДоИзм = Справочники.ГруппыНастроек.ПустаяСсылка();
	ЭлементыФормы.НаименованиеНастройки.Доступность = Истина;
	
КонецПроцедуры

//Процедура-обработчик события "НачалоВыбора" элемента формы "НаименованиеНастройки".
//
Процедура НаименованиеНастройкиНачалоВыбора(Элемент, СтандартнаяОбработка)	
	
	Если НаименованиеНастройки <> "" тогда
		
		ИзменяемаяНастройка =  СписокНастроек.Найти(НаименованиеНастройки);
		Если ИзменяемаяНастройка <> Неопределено тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("У пользователя " + Строка(ПараметрыСеанса.ТекущийПользователь.Наименование)+" уже есть настройка с таким именем!!! Продолжить?", Режим,, КодВозвратаДиалога.Нет);
				Если ответ = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
		КонецЕсли;					
		
		Принадлежность = ПараметрыСеанса.ТекущийПользователь;		
		НоваяСтрока = Списокнастроек.Добавить();
		НоваяСтрока.НаименованиеНастройки = НаименованиеНастройки;
		НоваяСтрока.ИспользоватьПриОткрытии = Ложь;
		НоваяСтрока.ОбщаяНастройка = Ложь;
		НоваяСтрока.Ссылка =СохранитьНастройки(ИмяОбъекта, НаименованиеНастройки, СохраняемоеЗначение, Принадлежность);
		НаименованиеНастройки = "";		
	Иначе
		Предупреждение("Задайте имя настройки!!!");
		Возврат;
	КонецЕсли; 	
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Обработчик действия командной панели "ОК"
//
Процедура ОсновныеДействияФормыОК(Элемент)
	
	Если ВидФормыСохранить Тогда
		
		Если НаименованиеНастройки <> "" тогда
			
			ИзменяемаяНастройка =  СписокНастроек.Найти(НаименованиеНастройки);
			Если ИзменяемаяНастройка <> Неопределено тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("У пользователя " + Строка(ПараметрыСеанса.ТекущийПользователь.Наименование)+" уже есть настройка с таким именем!!! Продолжить?", Режим,, КодВозвратаДиалога.Нет);
				Если ответ = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;				
			Если ЗначениеЗаполнено(ГруппаНастройки) Тогда 
				Принадлежность = ГруппаНастройки;
			Иначе
				Принадлежность = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
			НоваяСтрока = Списокнастроек.Добавить();
			НоваяСтрока.НаименованиеНастройки = НаименованиеНастройки;
			НоваяСтрока.ИспользоватьПриОткрытии = Ложь;
			НоваяСтрока.Ссылка = СохранитьНастройки(ИмяОбъекта, НаименованиеНастройки, СохраняемоеЗначение, Принадлежность);
			НаименованиеНастройки = "";		
		Иначе
			Предупреждение("Задайте имя настройки!!!");
			Возврат;
		КонецЕсли;
		
	ИначеЕсли  ЭлементыФормы.СписокНастроек.ТекущаяСтрока <> Неопределено Тогда
		ВосстановитьНастройку(ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка.Значение, ВладелецФормы);
	КонецЕсли;	
	
	Закрыть();
	
КонецПроцедуры

// Обработчик действия командной панели "Изменить"
//
Процедура ДействияСписокНастроекИзменить(Кнопка)
	
	Форма = ЭлементыФормы.СписокНастроек.ТекущаяСтрока.Ссылка.ПолучитьФорму(, ЭтаФорма);
	Форма.Открыть(); 	
	
КонецПроцедуры             

ГруппаНастройкиДоИзм = Справочники.ГруппыНастроек.ПустаяСсылка();
